#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.api_auth_token: Refreshing state... [id=none]
data.archive_file.lambda_package: Reading...
aws_acm_certificate.public_domain: Refreshing state... [id=arn:aws:acm:us-east-1:757214766189:certificate/aabb4187-bb45-446c-891d-b02ab7b77e2d]
data.aws_iam_policy_document.lambda_logging: Reading...
data.aws_iam_policy_document.lambda: Reading...
data.aws_route53_zone.domain: Reading...
data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=1779473963]
aws_dynamodb_table.tasks: Refreshing state... [id=eisenhower-api-test-tasks]
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.lambda: Read complete after 0s [id=3693445097]
aws_api_gateway_rest_api.monolith: Refreshing state... [id=udixge33sl]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::757214766189:policy/eisenhower-api-test-lambda-logging]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=3717859975]
aws_iam_role.lambda: Refreshing state... [id=eisenhower-api-test-lambda]
aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::757214766189:policy/eisenhower-api-test-lambda-permissions]
aws_iam_role_policy_attachment.lambda: Refreshing state... [id=eisenhower-api-test-lambda-20230423075106460700000002]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=eisenhower-api-test-lambda-20230423075106448900000001]
aws_api_gateway_resource.root_proxy: Refreshing state... [id=6idska]
aws_api_gateway_method.root_proxy_any: Refreshing state... [id=agm-udixge33sl-6idska-ANY]
aws_api_gateway_method.root_proxy_options: Refreshing state... [id=agm-udixge33sl-6idska-OPTIONS]
data.aws_route53_zone.domain: Read complete after 1s [id=Z05518322NZ4ZJDCDA4BE]
aws_route53_record.public_domain["api.eisenhower-test.internal.chrood.com"]: Refreshing state... [id=Z05518322NZ4ZJDCDA4BE__f248842a593d0998db44ba5b0c7aec0e.api.eisenhower-test.internal.chrood.com._CNAME]
aws_api_gateway_integration.root_proxy_options_mock: Refreshing state... [id=agi-udixge33sl-6idska-OPTIONS]
aws_api_gateway_method_response.root_proxy_options_200: Refreshing state... [id=agmr-udixge33sl-6idska-OPTIONS-200]
aws_api_gateway_method_response.root_proxy_any_200: Refreshing state... [id=agmr-udixge33sl-6idska-ANY-200]
aws_api_gateway_integration_response.root_proxy_options_200: Refreshing state... [id=agir-udixge33sl-6idska-OPTIONS-200]
aws_api_gateway_integration_response.root_proxy_options_mock: Refreshing state... [id=agir-udixge33sl-6idska-OPTIONS-200]
data.archive_file.lambda_package: Read complete after 2s [id=4aa6349af018b935096b8fe54a2033d73d8f6802]
aws_lambda_function.monolith: Refreshing state... [id=eisenhower-api-test-monolith]
aws_acm_certificate_validation.public_domain: Refreshing state... [id=2023-04-29 09:58:20.458 +0000 UTC]
aws_api_gateway_domain_name.stack_root_domain: Refreshing state... [id=api.eisenhower-test.internal.chrood.com]
aws_route53_record.root_domain_mapping: Refreshing state... [id=Z05518322NZ4ZJDCDA4BE_api.eisenhower-test.internal.chrood.com_A]
aws_lambda_permission.api_gateway_invocation: Refreshing state... [id=AllowExecutionFromApiGateway]
aws_api_gateway_integration.root_proxy: Refreshing state... [id=agi-udixge33sl-6idska-ANY]
aws_api_gateway_integration_response.root_proxy_any_200: Refreshing state... [id=agir-udixge33sl-6idska-ANY-200]
aws_api_gateway_deployment.monolith: Refreshing state... [id=w5llpc]
aws_api_gateway_stage.monolith: Refreshing state... [id=ags-udixge33sl-v1]
aws_api_gateway_base_path_mapping.stack_root_domain: Refreshing state... [id=api.eisenhower-test.internal.chrood.com/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.monolith will be updated in-place
  ~ resource "aws_lambda_function" "monolith" {
        id                             = "eisenhower-api-test-monolith"
      ~ last_modified                  = "2023-05-06T03:33:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:757214766189:function:eisenhower-api-test-monolith:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:757214766189:function:eisenhower-api-test-monolith:41/invocations" -> (known after apply)
      ~ source_code_hash               = "N24woEQcHi0B8k1kCjDCjWHnqI5CKX+eMuPvOSDbzfQ=" -> "HFZjQRzwyeIWlMATHz5bvXIddz0g4ubQ1BJ57PL4vm8="
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Workflow: `Deployment`*